{"modelTopology": {"keras_version": "2.1.4", "model_config": {"class_name": "Model", "config": {"name": "model_7", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_6", "sparse": false, "batch_input_shape": [null, 2]}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 100, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_15", "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 2048, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_16", "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null}, "name": "dense_16", "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "target_shape": [128, 4, 4]}, "name": "reshape_6", "inbound_nodes": [[["dense_16", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 64, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_transpose_1", "bias_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "name": "conv2d_transpose_1", "inbound_nodes": [[["reshape_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "scale": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "trainable": true, "center": true, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_12", "trainable": true}, "name": "leaky_re_lu_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 32, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_transpose_2", "bias_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "name": "conv2d_transpose_2", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "scale": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "trainable": true, "center": true, "epsilon": 0.001, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "name": "leaky_re_lu_13", "trainable": true}, "name": "leaky_re_lu_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 1, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_transpose_3", "bias_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "name": "conv2d_transpose_3", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}, "name": "flatten_5", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 784, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_17", "bias_regularizer": null, "trainable": true, "activation": "sigmoid", "bias_constraint": null}, "name": "dense_17", "inbound_nodes": [[["flatten_5", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["dense_17", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_12/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_12/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_12/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_12/moving_variance"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [32], "name": "batch_normalization_13/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_13/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_13/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_13/moving_variance"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 64, 4], "name": "conv2d_transpose_1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_transpose_1/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 32, 64], "name": "conv2d_transpose_2/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_transpose_2/bias"}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 3, 1, 32], "name": "conv2d_transpose_3/kernel"}, {"dtype": "float32", "shape": [1], "name": "conv2d_transpose_3/bias"}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "shape": [2, 100], "name": "dense_15/kernel"}, {"dtype": "float32", "shape": [100], "name": "dense_15/bias"}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "shape": [100, 2048], "name": "dense_16/kernel"}, {"dtype": "float32", "shape": [2048], "name": "dense_16/bias"}]}, {"paths": ["group8-shard1of2", "group8-shard2of2"], "weights": [{"dtype": "float32", "shape": [1340, 784], "name": "dense_17/kernel"}, {"dtype": "float32", "shape": [784], "name": "dense_17/bias"}]}]}