{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [784, 256], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [256], "name": "dense_1/bias", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [256, 2], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [2], "name": "dense_2/bias", "dtype": "float32"}]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.1.4", "model_config": {"class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 784]}}, {"class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 256, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 2, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}}], "input_layers": [["input_1", 0, 0]]}}}}