{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [2, 256], "name": "dense_4/kernel", "dtype": "float32"}, {"shape": [256], "name": "dense_4/bias", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [256, 784], "name": "dense_5/kernel", "dtype": "float32"}, {"shape": [784], "name": "dense_5/bias", "dtype": "float32"}]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.1.4", "model_config": {"class_name": "Model", "config": {"output_layers": [["dense_5", 0, 0]], "name": "model_3", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 2]}}, {"class_name": "Dense", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "dense_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_4", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 256, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dense_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_5", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 784, "activation": "sigmoid", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}}], "input_layers": [["input_2", 0, 0]]}}}}