{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [784, 256], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [256], "name": "dense_1/bias", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [256, 2], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [2], "name": "dense_2/bias", "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [256, 2], "name": "dense_3/kernel", "dtype": "float32"}, {"shape": [2], "name": "dense_3/bias", "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [2, 256], "name": "dense_4/kernel", "dtype": "float32"}, {"shape": [256], "name": "dense_4/bias", "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"shape": [256, 784], "name": "dense_5/kernel", "dtype": "float32"}, {"shape": [784], "name": "dense_5/bias", "dtype": "float32"}]}], "modelTopology": {"training_config": {"loss_weights": null, "metrics": [], "optimizer_config": {"class_name": "RMSprop", "config": {"decay": 0.0, "epsilon": 1e-07, "lr": 0.0010000000474974513, "rho": 0.8999999761581421}}, "loss": {}, "sample_weight_mode": null}, "backend": "tensorflow", "keras_version": "2.1.4", "model_config": {"class_name": "Model", "config": {"output_layers": [["dense_5", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 784]}}, {"class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 256, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 2, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_3", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 2, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Lambda", "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_3", 0, 0, {}]]], "name": "lambda_1", "config": {"name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "function": ["4wEAAAAAAAAABAAAAAcAAABDAAAAc1YAAAB8AABcAgB9AQB9AgB0AABqAQBkAQB0AABqAgB8AQCD\nAQBkAgAZdAMAZgIAZAMAZAQAZAUAdAQAgwADfQMAfAEAdAAAagUAfAIAZAYAG4MBAHwDABQXUykH\nTtoFc2hhcGXpAAAAANoEbWVhbucAAAAAAAAAANoGc3RkZGV26QIAAAApBtoBS9oNcmFuZG9tX25v\ncm1hbHIBAAAA2gpsYXRlbnRfZGlt2gtlcHNpbG9uX3N0ZNoDZXhwKQTaBGFyZ3PaBnpfbWVhbtoJ\nel9sb2dfdmFy2gdlcHNpbG9uqQByEAAAAPoePGlweXRob24taW5wdXQtMS03NTE4MzEwMTE5YmQ+\n2ghzYW1wbGluZx4AAABzCAAAAAABDAEoAQkB\n", null, null], "output_shape": [2], "arguments": {}}}, {"class_name": "Dense", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "dense_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_4", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 256, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dense_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_5", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 784, "activation": "sigmoid", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true}}], "input_layers": [["input_1", 0, 0]]}}}}